_emacs.d/init/init-helm.org
#+TITLE:    The League of Helm and Project Managements
#+AUTHOR:   Zuogong Yue
#+EMAIL:    oracleyue@gmail.com
#+DATE:     20 Apr 2018
#+STARTUP:  indent
#+OPTIONS:  H:6 num:t toc:t ^:nil _:nil \n:nil LaTeX:t


* Helm: the incremental completion framework

** Requirements
*** install software on the OS

In order to use features on live grep (see Section: *use helm to find/open
files*), you need to the following apps, if you need to use:
- ~grep~: the default grep on Linux/Unix;
- ~ack~ or ~ack-grep~: the improved grep (OS X: ~brew install ack~)
- ~ag~: a faster grep from =the_silver_searcher= (OS X: ~brew install the_silver_searcher~)

*** install packages on Emacs
    Adding a header for the exported =.el= file.
    #+BEGIN_SRC emacs-lisp
      ;; ================================================================
      ;; /Helm/ as the main completion system
      ;; ================================================================
    #+END_SRC

    Install the additional packages to support the =helm= package
    #+BEGIN_SRC emacs-lisp
      ;; Install required packages for more functions
      (setq custom/helm-packages
            '(helm
              helm-core))
      (custom/install-packages custom/helm-packages)
    #+END_SRC

