_emacs.d/init/readme/init-helm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-30 Mon 18:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The League of Helm and Project Managements</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zuogong Yue" />
<link rel="stylesheet" type="text/css" media="all" href="https://rawgit.com/oracleyue/dotfiles/master/_emacs.d/templates/css/bootstrap.min.css" />
<link rel="stylesheet" type="text/css" media="all" href="https://rawgit.com/oracleyue/dotfiles/master/_emacs.d/templates/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">The League of Helm and Project Managements</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6f8ccd7">1. Helm: the incremental completion framework</a>
<ul>
<li><a href="#orgabca5f2">1.1. Requirements</a>
<ul>
<li><a href="#org2e509bf">1.1.1. install software on the OS</a></li>
<li><a href="#org1b51025">1.1.2. install packages on Emacs</a></li>
</ul>
</li>
<li><a href="#orge329515">1.2. Basics configurations</a></li>
<li><a href="#orgb1e79e5">1.3. Functionality</a>
<ul>
<li><a href="#orgbb19a08">1.3.1. enhance Emacs basic functionality</a>
<ul>
<li><a href="#orgefa67b8">1.3.1.1. use helm to run M-x</a></li>
<li><a href="#orgea761ab">1.3.1.2. use helm to deal with mini-buffer</a></li>
<li><a href="#orgfa367a1">1.3.1.3. use helm to find/open files</a></li>
<li><a href="#org3e15814">1.3.1.4. resume the previous helm session</a></li>
<li><a href="#org08057d2">1.3.1.5. use helm to show "occur" (see <i>helm-swoop</i> for better functions)</a></li>
</ul>
</li>
<li><a href="#orgede05ef">1.3.2. show history of ring, register and shell command</a>
<ul>
<li><a href="#org7708cb1">1.3.2.1. use helm to show kill-ring</a></li>
<li><a href="#org54dcda2">1.3.2.2. view the local/global mark rings in helm</a></li>
<li><a href="#org361d065">1.3.2.3. use helm to view Emacs registers</a></li>
<li><a href="#orgb78a347">1.3.2.4. use helm to show <i>eshell</i> command history</a></li>
<li><a href="#orgf6a7d1a">1.3.2.5. use helm to show <i>shell</i> command history</a></li>
</ul>
</li>
<li><a href="#org3b06bac">1.3.3. use live grep in helm</a>
<ul>
<li><a href="#org908dff0">1.3.3.1. Usage</a></li>
<li><a href="#org205655b">1.3.3.2. Marked files</a></li>
<li><a href="#orgb8457c4">1.3.3.3. Recursive</a></li>
<li><a href="#org54001c1">1.3.3.4. Highlight results</a></li>
</ul>
</li>
<li><a href="#orgf55cda5">1.3.4. programming supports</a>
<ul>
<li><a href="#orgb82df00">1.3.4.1. use helm for fuzzy matching of <code>semantic</code> or <code>imenu</code> to summary C/C++ definitions</a></li>
</ul>
</li>
<li><a href="#org2ecc4e7">1.3.5. use helm for Emcas Help page</a></li>
<li><a href="#org12313cd">1.3.6. use helm to run system commands</a></li>
<li><a href="#orgc5489a5">1.3.7. miscellanies</a></li>
</ul>
</li>
<li><a href="#org7077be1">1.4. Summary of Keybindings</a></li>
</ul>
</li>
<li><a href="#org83bef53">2. Helm-Swoop: more powerful helm-occur</a>
<ul>
<li><a href="#org073bcf9">2.1. Install packages on Emacs</a></li>
<li><a href="#orgd50b22b">2.2. Keybindings</a></li>
<li><a href="#orgfdead47">2.3. Configurations on Features</a></li>
</ul>
</li>
<li><a href="#orgd229348">3. Exploring large projects with Projectile and Helm Projectile</a>
<ul>
<li><a href="#org678bcf4">3.1. Install Emacs packages</a></li>
<li><a href="#org8c02c5c">3.2. Package: <code>projectile</code></a></li>
<li><a href="#org115c600">3.3. Package: <code>helm-proctile</code></a>
<ul>
<li><a href="#org1f34b63">3.3.1. Enable helm-projectile</a></li>
<li><a href="#org14768fe">3.3.2. Basic commands</a></li>
<li><a href="#orgd30c42e">3.3.3. All-in-one command</a></li>
<li><a href="#org835eaa4">3.3.4. Enter project portal</a></li>
<li><a href="#org6fc8164">3.3.5. File management</a>
<ul>
<li><a href="#org93c3ff8">3.3.5.1. Command: <code>helm-projectile-find-file</code>, <code>C-c p f</code></a></li>
<li><a href="#org8c04bc7">3.3.5.2. Command: <code>helm-projectile-find-file-in-known-projects</code>, <code>C-c p F</code></a></li>
<li><a href="#org5e249d5">3.3.5.3. Command: <code>helm-projectile-find-file-dwim</code>, <code>C-c p g</code></a></li>
<li><a href="#orgddeae70">3.3.5.4. Command: <code>helm-projectile-find-dir</code>, <code>C-c p d</code></a></li>
<li><a href="#org390a726">3.3.5.5. Command: <code>helm-projectile-recentf</code>, <code>C-c p e</code></a></li>
<li><a href="#orgeaddbe0">3.3.5.6. Command: <code>helm-projectile-find-other-file</code>, <code>C-c p a</code></a></li>
<li><a href="#org900b9f9">3.3.5.7. [IMPORTANT] Caching</a></li>
</ul>
</li>
<li><a href="#org3864504">3.3.6. Virtual directory manager</a></li>
<li><a href="#orgfc9ffe0">3.3.7. Buffer management:</a></li>
<li><a href="#org34f8966">3.3.8. Search in project</a>
<ul>
<li><a href="#orgf7fd082">3.3.8.1. Command: <code>helm-projectile-grep</code>, <code>C-c p s g</code></a></li>
<li><a href="#org87e96ec">3.3.8.2. Command: <code>helm-projectile-ack</code>, <code>C-c p s a</code></a></li>
<li><a href="#org937601c">3.3.8.3. Command: <code>helm-projectile-ag</code>, <code>C-c p s s</code></a></li>
</ul>
</li>
<li><a href="#orgd4a97e3">3.3.9. Summary of keybindings</a></li>
<li><a href="#org48f9544">3.3.10. Suppress warnings from project-local variables</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4b615f9">4. Source code navigation via GNU Global with helm interface</a>
<ul>
<li><a href="#orgd581616">4.1. Requirements</a>
<ul>
<li><a href="#orgd7e4724">4.1.1. Emacs packages</a></li>
<li><a href="#org2bf653c">4.1.2. System commandline tools</a></li>
</ul>
</li>
<li><a href="#org56e8efa">4.2. Frontend via helm-gtags</a>
<ul>
<li><a href="#org84ae0d0">4.2.1. Basic settings</a></li>
<li><a href="#org384edd7">4.2.2. Keybindings</a></li>
</ul>
</li>
<li><a href="#org5c6b694">4.3. More on source code navigation by tuhdo.github.io</a></li>
</ul>
</li>
<li><a href="#orga8fe44c">5. End</a></li>
</ul>
</div>
</div>


<div id="outline-container-org6f8ccd7" class="outline-2">
<h2 id="org6f8ccd7"><span class="section-number-2">1</span> Helm: the incremental completion framework</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgabca5f2" class="outline-3">
<h3 id="orgabca5f2"><span class="section-number-3">1.1</span> Requirements</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2e509bf" class="outline-4">
<h4 id="org2e509bf"><span class="section-number-4">1.1.1</span> install software on the OS</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
In order to use features on live grep (see Section: <b>use helm to find/open
files</b>), you need to the following apps, if you need to use:
</p>
<ul class="org-ul">
<li><code>grep</code>: the default grep on Linux/Unix;</li>
<li><code>ack</code> or <code>ack-grep</code>: the improved grep (OS X: <code>brew install ack</code>)</li>
<li><code>ag</code>: a faster grep from <code>the_silver_searcher</code> (OS X: <code>brew install the_silver_searcher</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-org1b51025" class="outline-4">
<h4 id="org1b51025"><span class="section-number-4">1.1.2</span> install packages on Emacs</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Adding a header for the exported <code>.el</code> file.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">================================================================</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">/Helm/ as the main completion system</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">================================================================</span>
</pre>
</div>

<p>
Install the additional packages to support the <code>helm</code> package
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Install required packages for more functions</span>
(<span style="color: #859900;">setq</span> custom/helm-packages
      '(helm
        helm-core))
(custom/install-packages custom/helm-packages)
</pre>
</div>
</div>
</div>
</div>
