_emacs.d/init/init-helm.el
;; ================================================================
;; /Helm/ as the main completion system
;; ================================================================

;; Install required packages for more functions
(setq custom/helm-packages
      '(helm
        helm-core))
(custom/install-packages custom/helm-packages)
