_emacs.d/init/init-helm.org
** Basics configurations
#+BEGIN_SRC emacs-lisp
  ;; configuration for /helm/
  (require 'helm)
  (require 'helm-config)
#+END_SRC

#+BEGIN_WARNING
=semantic-mode= in CEDET causes ~M-x gdb~ hangs emacs in Mac OS X!
#+END_WARNING

Since the default =C-x c= is quite close to =C-x C-c=, which quits Emacs.
Changed to =C-c h= (labeled by =<helm-prefix>= in our later description). Note:
We must set =C-c h= globally, because we cannot change =helm-command-prefix-key=
once =helm-config= is loaded.

List of basic keybindings in the helm sessions:
- =<tab>=, =C-i= or =TAB=: run persistent actions;
- =C-z=: list available actions;
- =C-o=: switch between helm sources (e.g. jump from the historical list to the current list).

#+BEGIN_SRC emacs-lisp
  ;; Basic keybinding:
  (global-set-key (kbd "C-c h") 'helm-command-prefix)
  (global-unset-key (kbd "C-x c"))
  (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
  (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)
  (define-key helm-map (kbd "C-z") 'helm-select-action)

#+END_SRC

More basic settings and start =helm= mode:
#+BEGIN_SRC emacs-lisp
  ;; More basic settings:
  (setq ;; open helm buffer inside current window, not occupy whole other window
        helm-split-window-in-side-p           t
        ;; move to end or beginning of source when reaching top or bottom of source.
        helm-move-to-line-cycle-in-source     t
        ;; search for library in `require' and `declare-function' sexp.
        helm-ff-search-library-in-sexp        t
        ;; scroll 8 lines other window using M-<next>/M-<prior>
        helm-scroll-amount                    8
        ; helm-candidate-number-limit           500
        ; helm-move-to-line-cycle-in-source     t
        helm-ff-file-name-history-use-recentf t)

  (helm-mode 1)
#+END_SRC

Control the way to split and resize the helm buffer window:
#+BEGIN_SRC emacs-lisp
  (setq ;; default way to split window
        ; helm-split-window-default-side    'right
        ;; adjust the max height for helm buffer
        ; helm-autoresize-max-height 50
        ;; auto-resize buffer to fit candidates (disble golden-ratio)
        helm-autoresize-mode              t)
#+END_SRC
** Functionality
*** enhance Emacs basic functionality
**** use helm to run M-x
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-x") 'helm-M-x)
  (setq helm-M-x-fuzzy-match t) ;; optional fuzzy matching for helm-M-x
#+END_SRC

**** use helm to deal with mini-buffer
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x b") 'helm-mini)
  ;; enable fuzzy matching
  (setq helm-buffers-fuzzy-matching   t
        helm-recentf-fuzzy-match      t)
#+END_SRC

**** use helm to find/open files

Default keybinding: =<helm-prefix> C-x C-f=; in this session, =C-c i= will insert the
current absolute path into the current buffer. Here we rebind the key to
overwrite the default find file action. And by setting
=helm-boring-file-regexp-list= to avoid showing useless temporary files.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-f") 'helm-find-files)
  ;; skip meaningless files, e.g. .DS_Store
  (setq helm-ff-skip-boring-files t)
  (delete '"\\.bbl$" helm-boring-file-regexp-list)    ;show .bbl file
  (add-to-list 'helm-boring-file-regexp-list "\\.DS_Store$")
  (add-to-list 'helm-boring-file-regexp-list ".*\.synctex\.gz$")
  (add-to-list 'helm-boring-file-regexp-list ".*\.url$")
  (add-to-list 'helm-boring-file-regexp-list "\\.dropbox$")
  (add-to-list 'helm-boring-file-regexp-list "Icon.*")
  (add-to-list 'helm-boring-file-regexp-list "#.*#$")
  (add-to-list 'helm-boring-file-regexp-list "\\.out$")
#+END_SRC

**** resume the previous helm session
Keybinding: =<helm-prefix> b=

**** use helm to show "occur" (see /helm-swoop/ for better functions)
Keybinding: =<helm-prefix> M-s o=

*** show history of ring, register and shell command
