_emacs.d/init/readme/init-helm.html

<div id="outline-container-orge329515" class="outline-3">
<h3 id="orge329515"><span class="section-number-3">1.2</span> Basics configurations</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">configuration for /helm/</span>
(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">helm</span>)
(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">helm-config</span>)
</pre>
</div>

<div class="WARNING">
<p>
<code>semantic-mode</code> in CEDET causes <code>M-x gdb</code> hangs emacs in Mac OS X!
</p>

</div>

<p>
Since the default <code>C-x c</code> is quite close to <code>C-x C-c</code>, which quits Emacs.
Changed to <code>C-c h</code> (labeled by <code>&lt;helm-prefix&gt;</code> in our later description). Note:
We must set <code>C-c h</code> globally, because we cannot change <code>helm-command-prefix-key</code>
once <code>helm-config</code> is loaded.
</p>

<p>
List of basic keybindings in the helm sessions:
</p>
<ul class="org-ul">
<li><code>&lt;tab&gt;</code>, <code>C-i</code> or <code>TAB</code>: run persistent actions;</li>
<li><code>C-z</code>: list available actions;</li>
<li><code>C-o</code>: switch between helm sources (e.g. jump from the historical list to the current list).</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Basic keybinding:</span>
(global-set-key (kbd <span style="color: #2aa198;">"C-c h"</span>) 'helm-command-prefix)
(global-unset-key (kbd <span style="color: #2aa198;">"C-x c"</span>))
(define-key helm-map (kbd <span style="color: #2aa198;">"&lt;tab&gt;"</span>) 'helm-execute-persistent-action)
(define-key helm-map (kbd <span style="color: #2aa198;">"C-i"</span>) 'helm-execute-persistent-action)
(define-key helm-map (kbd <span style="color: #2aa198;">"C-z"</span>) 'helm-select-action)

</pre>
</div>

<p>
More basic settings and start <code>helm</code> mode:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">More basic settings:</span>
(<span style="color: #859900;">setq</span> <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">open helm buffer inside current window, not occupy whole other window</span>
      helm-split-window-in-side-p           t
      <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">move to end or beginning of source when reaching top or bottom of source.</span>
      helm-move-to-line-cycle-in-source     t
      <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">search for library in `</span><span style="color: #2aa198; font-style: italic;">require</span><span style="color: #93a1a1; font-style: italic;">' and `</span><span style="color: #2aa198; font-style: italic;">declare-function</span><span style="color: #93a1a1; font-style: italic;">' sexp.</span>
      helm-ff-search-library-in-sexp        t
      <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">scroll 8 lines other window using M-&lt;next&gt;/M-&lt;prior&gt;</span>
      helm-scroll-amount                    8
      <span style="color: #93a1a1; font-style: italic;">; </span><span style="color: #93a1a1; font-style: italic;">helm-candidate-number-limit           500</span>
      <span style="color: #93a1a1; font-style: italic;">; </span><span style="color: #93a1a1; font-style: italic;">helm-move-to-line-cycle-in-source     t</span>
      helm-ff-file-name-history-use-recentf t)

(helm-mode 1)
</pre>
</div>

<p>
Control the way to split and resize the helm buffer window:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #859900;">setq</span> <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">default way to split window</span>
      <span style="color: #93a1a1; font-style: italic;">; </span><span style="color: #93a1a1; font-style: italic;">helm-split-window-default-side    'right</span>
      <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">adjust the max height for helm buffer</span>
      <span style="color: #93a1a1; font-style: italic;">; </span><span style="color: #93a1a1; font-style: italic;">helm-autoresize-max-height 50</span>
      <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">auto-resize buffer to fit candidates (disble golden-ratio)</span>
      helm-autoresize-mode              t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb1e79e5" class="outline-3">
<h3 id="orgb1e79e5"><span class="section-number-3">1.3</span> Functionality</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgbb19a08" class="outline-4">
<h4 id="orgbb19a08"><span class="section-number-4">1.3.1</span> enhance Emacs basic functionality</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<div id="outline-container-orgefa67b8" class="outline-5">
<h5 id="orgefa67b8"><span class="section-number-5">1.3.1.1</span> use helm to run M-x</h5>
<div class="outline-text-5" id="text-1-3-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #2aa198;">"M-x"</span>) 'helm-M-x)
(<span style="color: #859900;">setq</span> helm-M-x-fuzzy-match t) <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">optional fuzzy matching for helm-M-x</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea761ab" class="outline-5">
<h5 id="orgea761ab"><span class="section-number-5">1.3.1.2</span> use helm to deal with mini-buffer</h5>
<div class="outline-text-5" id="text-1-3-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #2aa198;">"C-x b"</span>) 'helm-mini)
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">enable fuzzy matching</span>
(<span style="color: #859900;">setq</span> helm-buffers-fuzzy-matching   t
      helm-recentf-fuzzy-match      t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa367a1" class="outline-5">
<h5 id="orgfa367a1"><span class="section-number-5">1.3.1.3</span> use helm to find/open files</h5>
<div class="outline-text-5" id="text-1-3-1-3">
<p>
Default keybinding: <code>&lt;helm-prefix&gt; C-x C-f</code>; in this session, <code>C-c i</code> will insert the
current absolute path into the current buffer. Here we rebind the key to
overwrite the default find file action. And by setting
<code>helm-boring-file-regexp-list</code> to avoid showing useless temporary files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #2aa198;">"C-x C-f"</span>) 'helm-find-files)
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">skip meaningless files, e.g. .DS_Store</span>
(<span style="color: #859900;">setq</span> helm-ff-skip-boring-files t)
(delete '<span style="color: #2aa198;">"\\.bbl$"</span> helm-boring-file-regexp-list)    <span style="color: #93a1a1; font-style: italic;">;</span><span style="color: #93a1a1; font-style: italic;">show .bbl file</span>
(add-to-list 'helm-boring-file-regexp-list <span style="color: #2aa198;">"\\.DS_Store$"</span>)
(add-to-list 'helm-boring-file-regexp-list <span style="color: #2aa198;">".*\.synctex\.gz$"</span>)
(add-to-list 'helm-boring-file-regexp-list <span style="color: #2aa198;">".*\.url$"</span>)
(add-to-list 'helm-boring-file-regexp-list <span style="color: #2aa198;">"\\.dropbox$"</span>)
(add-to-list 'helm-boring-file-regexp-list <span style="color: #2aa198;">"Icon.*"</span>)
(add-to-list 'helm-boring-file-regexp-list <span style="color: #2aa198;">"#.*#$"</span>)
(add-to-list 'helm-boring-file-regexp-list <span style="color: #2aa198;">"\\.out$"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e15814" class="outline-5">
<h5 id="org3e15814"><span class="section-number-5">1.3.1.4</span> resume the previous helm session</h5>
<div class="outline-text-5" id="text-1-3-1-4">
<p>
Keybinding: <code>&lt;helm-prefix&gt; b</code>
</p>
</div>
</div>

<div id="outline-container-org08057d2" class="outline-5">
<h5 id="org08057d2"><span class="section-number-5">1.3.1.5</span> use helm to show "occur" (see <i>helm-swoop</i> for better functions)</h5>
<div class="outline-text-5" id="text-1-3-1-5">
<p>
Keybinding: <code>&lt;helm-prefix&gt; M-s o</code>
</p>
</div>
</div>
</div>

<div id="outline-container-orgede05ef" class="outline-4">
<h4 id="orgede05ef"><span class="section-number-4">1.3.2</span> show history of ring, register and shell command</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
