_emacs.d/init/init-helm.el

;; configuration for /helm/
(require 'helm)
(require 'helm-config)

;; Basic keybinding:
(global-set-key (kbd "C-c h") 'helm-command-prefix)
(global-unset-key (kbd "C-x c"))
(define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
(define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)
(define-key helm-map (kbd "C-z") 'helm-select-action)

;; More basic settings:
(setq ;; open helm buffer inside current window, not occupy whole other window
      helm-split-window-in-side-p           t
      ;; move to end or beginning of source when reaching top or bottom of source.
      helm-move-to-line-cycle-in-source     t
      ;; search for library in `require' and `declare-function' sexp.
      helm-ff-search-library-in-sexp        t
      ;; scroll 8 lines other window using M-<next>/M-<prior>
      helm-scroll-amount                    8
      ; helm-candidate-number-limit           500
      ; helm-move-to-line-cycle-in-source     t
      helm-ff-file-name-history-use-recentf t)

(helm-mode 1)

(setq ;; default way to split window
      ; helm-split-window-default-side    'right
      ;; adjust the max height for helm buffer
      ; helm-autoresize-max-height 50
      ;; auto-resize buffer to fit candidates (disble golden-ratio)
      helm-autoresize-mode              t)

(global-set-key (kbd "M-x") 'helm-M-x)
(setq helm-M-x-fuzzy-match t) ;; optional fuzzy matching for helm-M-x

(global-set-key (kbd "C-x b") 'helm-mini)
;; enable fuzzy matching
(setq helm-buffers-fuzzy-matching   t
      helm-recentf-fuzzy-match      t)

(global-set-key (kbd "C-x C-f") 'helm-find-files)
;; skip meaningless files, e.g. .DS_Store
(setq helm-ff-skip-boring-files t)
(delete '"\\.bbl$" helm-boring-file-regexp-list)    ;show .bbl file
(add-to-list 'helm-boring-file-regexp-list "\\.DS_Store$")
(add-to-list 'helm-boring-file-regexp-list ".*\.synctex\.gz$")
(add-to-list 'helm-boring-file-regexp-list ".*\.url$")
(add-to-list 'helm-boring-file-regexp-list "\\.dropbox$")
(add-to-list 'helm-boring-file-regexp-list "Icon.*")
(add-to-list 'helm-boring-file-regexp-list "#.*#$")
(add-to-list 'helm-boring-file-regexp-list "\\.out$")

(global-set-key (kbd "M-y") 'helm-show-kill-ring)
