_emacs.d/init/init-helm.org
**** use helm to show kill-ring
This is to list all entries in the king ring that are available for =C-y=.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-y") 'helm-show-kill-ring)
#+END_SRC

**** view the local/global mark rings in helm
Default keybinding: =<helm-prefix> C-c SPC=
#+BEGIN_SRC emacs-lisp
  ;; use helm to show the mark-ring
  (global-set-key (kbd "C-c h SPC") 'helm-all-mark-rings)
  (global-set-key (kbd "M-g SPC") 'helm-all-mark-rings)
#+END_SRC

**** use helm to view Emacs registers
Keybinding: =<helm-prefix> C-x r i=

Functions:
-     =[F1]= insert register content into buffer
-     =[F2]= append an active region to current content in highlighting register
-     =[F3]= prepend an active region to current content in highlighting register

#+BEGIN_SRC emacs-lisp
  ;; use helm to show the register
  (global-set-key (kbd "C-c h x") 'helm-register)
#+END_SRC

**** use helm to show /eshell/ command history
#+BEGIN_SRC emacs-lisp
  ;; use helm to show /eshell/ command history
  (require 'helm-eshell)
  (add-hook 'eshell-mode-hook #'(lambda ()
     (define-key eshell-mode-map (kbd "C-c C-l")  'helm-eshell-history)))
#+END_SRC

**** use helm to show /shell/ command history
#+BEGIN_SRC
  (define-key shell-mode-map (kbd "C-c C-l") 'helm-comint-input-ring)
#+END_SRC

*** use live grep in helm

Helm grep is a Helm implementation of the grep command, which searches a text
file for lines matching a regular expression.

Quick view of commands in the =C-x C-f= session:
- =C-s= or =M-g s=: use ~grep/ack~ to match patterns in the current buffer;
- =C-u C-s= or =C-u M-g s=: use ~grep/ack~ to match patterns any files with the
  same extension in the current folder;
- =M-g a=: use ~ag~ to match patterns in all files in the current folder.
- =C-u M-g a=: select extension types before run ~ag~

or, globally, use =M-g a= that run ~helm-do-grep-ag~.

_Suggested practice_:
- use ~ack~ (=C-s=) to grep files: the current file, or the files in the current
  folder when the cursor is on the directory (i.e. the top line of
  /helm-find-files/ buffer);
- use ~ag~ (=M-g a=) to grep the directorzyue/ recursively grep all files in the
  current directory
- if you want to grep files with a specific extension, use =C-u C-s=.

**** Usage
From ~helm-find-files~ (=<helm-prefix> C-x C-f=), open the action menu with
=C-z= and choose grep. A prefix argument will launch recursive grep.  You can
also launch grep directly with =(C-u) C-s= or =(C-u) M-g s=
(i.e. ~helm-ff-run-grep~) without switching to the action menu.

#+BEGIN_SRC emacs-lisp
  ;; set global-key for function: =M-g a= in session of =C-x C-f=
  (global-set-key (kbd "M-g a") 'helm-do-grep-ag)
#+END_SRC

**** Marked files
To grep marked files, just mark some files with =C-<space>= and launch
grep. Marked files can be from different directories.

**** Recursive
Go to the root of the directory you want to grep in, then hit =C-z= to open the
action menu and choose grep with a prefix argument (=C-u=).

You will be prompted for types of files to search. Wildcard syntax like =\*.el=
(which searches only files ending in =.el=) is allowed. With =ack-grep= you will
be prompted instead for ack-grep types, see ack-grep documentation on how define
types in your =.ackrc= file.

By default, the extension of the file at point is used when the cursor is on a
file name. If the cursor is at root of a directory, all the file name extensions
found in the directory and not matching the variable ~grep-find-ignored-files~
are inserted into the prompt.

**** Highlight results
By default, Helm applies its own highlights to matched items. However, it may be
better to use the backend to highlight result with ANSI sequences.  This can be
done by customizing the ~helm-grep-default-command~ variable.

~grep~:
#+BEGIN_SRC
  (setq helm-grep-default-command   ;; ~grep~
        "grep --color=always -d skip %e -n%cH -e %p %f"
        helm-grep-default-recurse-command
        "grep --color=always -d recurse %e -n%cH -e %p %f")
#+END_SRC

~ack~:
#+BEGIN_SRC emacs-lisp
(setq helm-grep-default-command     ;; ~ack~
      "ack -Hn --color --smart-case --no-group %e %p %f"
      helm-grep-default-recurse-command
      "ack -H --color --smart-case --no-group %e %p %f")
#+END_SRC

~git-grep~:
#+BEGIN_SRC emacs-lisp
  (setq helm-ls-git-grep-command    ;; ~git-grep~
        "git grep -n%cH --color=always --full-name -e %p %f")
#+END_SRC

~ag~ (the silver searcher):
#+BEGIN_SRC emacs-lisp
  (setq helm-grep-ag-command        ;; ~ag~ from "the-silver-searcher"
        "ag --line-numbers -S --hidden --color --color-match '31;43' \
            --nogroup %s %s %s")
  (setq helm-grep-ag-pipe-cmd-switches '("--color-match '31;43'"))
#+END_SRC

~rg~ (riggrep):
#+BEGIN_SRC
  (setq helm-grep-ag-command        ;; ~rg (ripgrep)~
        "rg --color=always --colors 'match:fg:black' --colors 'match:bg:yellow' --smart-case --no-heading --line-number %s %s %s")
  (setq helm-grep-ag-pipe-cmd-switches
        '("--colors 'match:fg:black'" "--colors 'match:bg:yellow'"))
#+END_SRC

*** programming supports
