_emacs.d/init/readme/init-helm.html
<div id="outline-container-org7708cb1" class="outline-5">
<h5 id="org7708cb1"><span class="section-number-5">1.3.2.1</span> use helm to show kill-ring</h5>
<div class="outline-text-5" id="text-1-3-2-1">
<p>
This is to list all entries in the king ring that are available for <code>C-y</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #2aa198;">"M-y"</span>) 'helm-show-kill-ring)
</pre>
</div>
</div>
</div>

<div id="outline-container-org54dcda2" class="outline-5">
<h5 id="org54dcda2"><span class="section-number-5">1.3.2.2</span> view the local/global mark rings in helm</h5>
<div class="outline-text-5" id="text-1-3-2-2">
<p>
Default keybinding: <code>&lt;helm-prefix&gt; C-c SPC</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">use helm to show the mark-ring</span>
(global-set-key (kbd <span style="color: #2aa198;">"C-c h SPC"</span>) 'helm-all-mark-rings)
(global-set-key (kbd <span style="color: #2aa198;">"M-g SPC"</span>) 'helm-all-mark-rings)
</pre>
</div>
</div>
</div>

<div id="outline-container-org361d065" class="outline-5">
<h5 id="org361d065"><span class="section-number-5">1.3.2.3</span> use helm to view Emacs registers</h5>
<div class="outline-text-5" id="text-1-3-2-3">
<p>
Keybinding: <code>&lt;helm-prefix&gt; C-x r i</code>
</p>

<p>
Functions:
</p>
<ul class="org-ul">
<li><code>[F1]</code> insert register content into buffer</li>
<li><code>[F2]</code> append an active region to current content in highlighting register</li>
<li><code>[F3]</code> prepend an active region to current content in highlighting register</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">use helm to show the register</span>
(global-set-key (kbd <span style="color: #2aa198;">"C-c h x"</span>) 'helm-register)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb78a347" class="outline-5">
<h5 id="orgb78a347"><span class="section-number-5">1.3.2.4</span> use helm to show <i>eshell</i> command history</h5>
<div class="outline-text-5" id="text-1-3-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">use helm to show /eshell/ command history</span>
(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">helm-eshell</span>)
(add-hook 'eshell-mode-hook #'(lambda ()
   (define-key eshell-mode-map (kbd <span style="color: #2aa198;">"C-c C-l"</span>)  'helm-eshell-history)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf6a7d1a" class="outline-5">
<h5 id="orgf6a7d1a"><span class="section-number-5">1.3.2.5</span> use helm to show <i>shell</i> command history</h5>
<div class="outline-text-5" id="text-1-3-2-5">
<pre class="example">
(define-key shell-mode-map (kbd "C-c C-l") 'helm-comint-input-ring)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3b06bac" class="outline-4">
<h4 id="org3b06bac"><span class="section-number-4">1.3.3</span> use live grep in helm</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Helm grep is a Helm implementation of the grep command, which searches a text
file for lines matching a regular expression.
</p>

<p>
Quick view of useful commands: under <code>C-x C-f</code> session,
</p>

<ul class="org-ul">
<li><code>C-s</code> or <code>M-g s</code>: use <code>grep/ack</code> to match patterns in the current buffer;</li>
<li><code>C-u C-s</code> or <code>C-u M-g s</code>: use <code>grep/ack</code> to match patterns any files with the
same extension in the current folder;</li>
<li><code>M-g a</code>: use <code>ag</code> to match patterns in all files in the current folder.</li>
<li><code>C-u M-g a</code>: select extension types before run <code>ag</code></li>
</ul>

<p>
or, globally, use <code>M-g a</code> that run <code>helm-do-grep-ag</code>.
</p>

<p>
<span class="underline">Suggested practice</span>:
</p>
<ul class="org-ul">
<li>use <code>ack</code> (<code>C-s</code>) to grep files: the current file, or the files in the current
folder when the cursor is on the directory (i.e. the top line of
<i>helm-find-files</i> buffer);</li>
<li>use <code>ag</code> (<code>M-g a</code>) to grep the directory: recursively grep all files in the
current directory</li>
<li>if you want to grep files with a specific extension, use <code>C-u C-s</code>.</li>
</ul>
</div>

<div id="outline-container-org908dff0" class="outline-5">
<h5 id="org908dff0"><span class="section-number-5">1.3.3.1</span> Usage</h5>
<div class="outline-text-5" id="text-1-3-3-1">
<p>
From <code>helm-find-files</code> (<code>&lt;helm-prefix&gt; C-x C-f</code>), open the action menu with
<code>C-z</code> and choose grep. A prefix argument will launch recursive grep.  You can
also launch grep directly with <code>(C-u) C-s</code> or <code>(C-u) M-g s</code>
(i.e. <code>helm-ff-run-grep</code>) without switching to the action menu.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">set global-key for function: =M-g a= in session of =C-x C-f=</span>
(global-set-key (kbd <span style="color: #2aa198;">"M-g a"</span>) 'helm-do-grep-ag)
</pre>
</div>
</div>
</div>

<div id="outline-container-org205655b" class="outline-5">
<h5 id="org205655b"><span class="section-number-5">1.3.3.2</span> Marked files</h5>
<div class="outline-text-5" id="text-1-3-3-2">
<p>
To grep marked files, just mark some files with <code>C-&lt;space&gt;</code> and launch
grep. Marked files can be from different directories.
</p>
</div>
</div>

<div id="outline-container-orgb8457c4" class="outline-5">
<h5 id="orgb8457c4"><span class="section-number-5">1.3.3.3</span> Recursive</h5>
<div class="outline-text-5" id="text-1-3-3-3">
<p>
Go to the root of the directory you want to grep in, then hit <code>C-z</code> to open the
action menu and choose grep with a prefix argument (<code>C-u</code>).
</p>

<p>
You will be prompted for types of files to search. Wildcard syntax like <code>\*.el</code>
(which searches only files ending in <code>.el</code>) is allowed. With <code>ack-grep</code> you will
be prompted instead for ack-grep types, see ack-grep documentation on how define
types in your <code>.ackrc</code> file.
</p>

<p>
By default, the extension of the file at point is used when the cursor is on a
file name. If the cursor is at root of a directory, all the file name extensions
found in the directory and not matching the variable <code>grep-find-ignored-files</code>
are inserted into the prompt.
</p>
</div>
</div>

<div id="outline-container-org54001c1" class="outline-5">
<h5 id="org54001c1"><span class="section-number-5">1.3.3.4</span> Highlight results</h5>
<div class="outline-text-5" id="text-1-3-3-4">
<p>
By default, Helm applies its own highlights to matched items. However, it may be
better to use the backend to highlight result with ANSI sequences.  This can be
done by customizing the <code>helm-grep-default-command</code> variable.
</p>

<p>
<code>grep</code>:
</p>
<pre class="example">
(setq helm-grep-default-command   ;; ~grep~
      "grep --color=always -d skip %e -n%cH -e %p %f"
      helm-grep-default-recurse-command
      "grep --color=always -d recurse %e -n%cH -e %p %f")
</pre>

<p>
<code>ack</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #859900;">setq</span> helm-grep-default-command     <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">~ack~</span>
      <span style="color: #2aa198;">"ack -Hn --color --smart-case --no-group %e %p %f"</span>
      helm-grep-default-recurse-command
      <span style="color: #2aa198;">"ack -H --color --smart-case --no-group %e %p %f"</span>)
</pre>
</div>

<p>
<code>git-grep</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #859900;">setq</span> helm-ls-git-grep-command    <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">~git-grep~</span>
      <span style="color: #2aa198;">"git grep -n%cH --color=always --full-name -e %p %f"</span>)
</pre>
</div>

<p>
<code>ag</code> (the silver searcher):
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #859900;">setq</span> helm-grep-ag-command        <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">~ag~ from "the-silver-searcher"</span>
      <span style="color: #2aa198;">"ag --line-numbers -S --hidden --color --color-match '31;43' \</span>
<span style="color: #2aa198;">          --nogroup %s %s %s"</span>)
(<span style="color: #859900;">setq</span> helm-grep-ag-pipe-cmd-switches '(<span style="color: #2aa198;">"--color-match '31;43'"</span>))
</pre>
</div>

<p>
<code>rg</code> (riggrep):
</p>
<pre class="example">
(setq helm-grep-ag-command        ;; ~rg (ripgrep)~
      "rg --color=always --colors 'match:fg:black' --colors 'match:bg:yellow' --smart-case --no-heading --line-number %s %s %s")
(setq helm-grep-ag-pipe-cmd-switches
      '("--colors 'match:fg:black'" "--colors 'match:bg:yellow'"))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf55cda5" class="outline-4">
<h4 id="orgf55cda5"><span class="section-number-4">1.3.4</span> programming supports</h4>
<div class="outline-text-4" id="text-1-3-4">
</div>
