_emacs.d/init/init-helm.el

;; use helm to show the mark-ring
(global-set-key (kbd "C-c h SPC") 'helm-all-mark-rings)
(global-set-key (kbd "M-g SPC") 'helm-all-mark-rings)

;; use helm to show the register
(global-set-key (kbd "C-c h x") 'helm-register)

;; use helm to show /eshell/ command history
(require 'helm-eshell)
(add-hook 'eshell-mode-hook #'(lambda ()
   (define-key eshell-mode-map (kbd "C-c C-l")  'helm-eshell-history)))

;; set global-key for function: =M-g a= in session of =C-x C-f=
(global-set-key (kbd "M-g a") 'helm-do-grep-ag)

(setq helm-grep-default-command     ;; ~ack~
      "ack -Hn --color --smart-case --no-group %e %p %f"
      helm-grep-default-recurse-command
      "ack -H --color --smart-case --no-group %e %p %f")

(setq helm-ls-git-grep-command    ;; ~git-grep~
      "git grep -n%cH --color=always --full-name -e %p %f")

(setq helm-grep-ag-command        ;; ~ag~ from "the-silver-searcher"
      "ag --line-numbers -S --hidden --color --color-match '31;43' \
          --nogroup %s %s %s")
(setq helm-grep-ag-pipe-cmd-switches '("--color-match '31;43'"))
