_emacs.d/init/init-helm.org
**** use helm for fuzzy matching of =semantic= or =imenu= to summary C/C++ definitions
Keybinding: =<helm-prefix> i=
Command: ~helm-semantic-or-imenu~

This function supports most programming languages, not only C/C++. Note that, to
use =semantic=, we need to turn on the CEDET's *semantics* module.  We control
the feature on =semantic= by the constant ~*enable-semantics*~ defined in
=init-features.el=.

#+BEGIN_SRC emacs-lisp
  (setq helm-semantic-fuzzy-match t
        helm-imenu-fuzzy-match    t)
  (with-eval-after-load 'helm-semantic      ;; default: C, python, elisp
    (push '(c++-mode . semantic-format-tag-summarize) helm-semantic-display-style)
    (push '(c-mode . semantic-format-tag-summarize) helm-semantic-display-style)
    (push '(emacs-lisp-mode . semantic-format-tag-summarize) helm-semantic-display-style)
    (nbutlast helm-semantic-display-style 2)) ;; remove the default elisp setting
#+END_SRC

*** use helm for Emcas Help page

Use helm to show help doc (=C-h a=): =<helm-prefix> a=
#+BEGIN_SRC emacs-lisp
  ;; helm for Emacs help functions
  (setq helm-apropos-fuzzy-match t)
#+END_SRC

Use helm to show info: =<helm-prefix> h <key>= (=<key>=: =g, i, r=)

Use helm to do completion for Lisp: =<helm-prefix> <tab>=
#+BEGIN_SRC emacs-lisp
  (setq helm-lisp-fuzzy-completion t)
#+END_SRC

*** use helm to run system commands
List of supported commands:
- ~man~
- ~find~
- ~locate~
- ~top~
- ~calc~

Use helm to quick-jump to any ~man~ entrzyue/ =<helm-prefix> m=
#+BEGIN_SRC emacs-lisp
  ;; helm for system man page
  (when (string-equal system-type "darwin")
    (setq helm-man-format-switches "%s"))
  (add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)
#+END_SRC

Use Unix ~find~ in helm interface: =<helm-prefix> /=
#+BEGIN_SRC emacs-lisp
  ;; helm find
  (global-set-key (kbd "M-g /") 'helm-find)
#+END_SRC

Use Unix ~locate~ in helm interface: =<helm-prefix> l=
#+BEGIN_SRC emacs-lisp
  ;; helm for system command "locate"
  (setq helm-locate-fuzzy-match t)
#+END_SRC

Show Unix ~top~ in helm interface: =<helm-prefix> t= \\
Functions:
-     =[C-c C-u]=  : refresh "helm-top"
-     =[M-c]=           : sort by ~shell commands~
-     =[M-p]=           : sort by ~cpu usage~
-     =[M-u]=           : sort by ~user~
-     =[M-m]=           : sort by ~memory~

Use Unix GNU-calc command in helm interface: =<helm-prefix> C-,=
*** miscellanies
Use helm to build regexp, test them interactivelzyue/ =<helm-prefix> r=    \\
Functions:
-     =[F1]= save the regexp as a string in =kill-ring=
-     =[F2]= invoke =query-replace= with curent regexp to be replace
-     =[F3]= save the regexp as is in the current helm prompt

Quickly view and copy hexadecimal values of colors: =<helm-prefix> c=

Instant eval Emacs Lisp expression in helm buffer: =<helm-prefix> C-:=
#+BEGIN_SRC
  (global-set-key (kbd "C-c h M-:") 'helm-eval-expression-with-eldoc)
#+END_SRC

