_emacs.d/init/readme/init-helm.html
<div id="outline-container-orgb82df00" class="outline-5">
<h5 id="orgb82df00"><span class="section-number-5">1.3.4.1</span> use helm for fuzzy matching of <code>semantic</code> or <code>imenu</code> to summary C/C++ definitions</h5>
<div class="outline-text-5" id="text-1-3-4-1">
<p>
Keybinding: <code>&lt;helm-prefix&gt; i</code>
Command: <code>helm-semantic-or-imenu</code>
</p>

<p>
This function supports most programming languages, not only C/C++. Note that, to
use <code>semantic</code>, we need to turn on the CEDET's <b>semantics</b> module.  We control
the feature on <code>semantic</code> by the constant <code>*enable-semantics*</code> defined in
<code>init-features.el</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #859900;">setq</span> helm-semantic-fuzzy-match t
      helm-imenu-fuzzy-match    t)
(<span style="color: #859900;">with-eval-after-load</span> 'helm-semantic      <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">default: C, python, elisp</span>
  (<span style="color: #859900;">push</span> '(c++-mode . semantic-format-tag-summarize) helm-semantic-display-style)
  (<span style="color: #859900;">push</span> '(c-mode . semantic-format-tag-summarize) helm-semantic-display-style)
  (<span style="color: #859900;">push</span> '(emacs-lisp-mode . semantic-format-tag-summarize) helm-semantic-display-style)
  (nbutlast helm-semantic-display-style 2)) <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">remove the default elisp setting</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2ecc4e7" class="outline-4">
<h4 id="org2ecc4e7"><span class="section-number-4">1.3.5</span> use helm for Emcas Help page</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
Use helm to show help doc (<code>C-h a</code>): <code>&lt;helm-prefix&gt; a</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">helm for Emacs help functions</span>
(<span style="color: #859900;">setq</span> helm-apropos-fuzzy-match t)
</pre>
</div>

<p>
Use helm to show info: <code>&lt;helm-prefix&gt; h &lt;key&gt;</code> (<code>&lt;key&gt;</code>: <code>g, i, r</code>)
</p>

<p>
Use helm to do completion for Lisp: <code>&lt;helm-prefix&gt; &lt;tab&gt;</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #859900;">setq</span> helm-lisp-fuzzy-completion t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org12313cd" class="outline-4">
<h4 id="org12313cd"><span class="section-number-4">1.3.6</span> use helm to run system commands</h4>
<div class="outline-text-4" id="text-1-3-6">
<p>
List of supported commands:
</p>
<ul class="org-ul">
<li><code>man</code></li>
<li><code>find</code></li>
<li><code>locate</code></li>
<li><code>top</code></li>
<li><code>calc</code></li>
</ul>

<p>
Use helm to quick-jump to any <code>man</code> entry: <code>&lt;helm-prefix&gt; m</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">helm for system man page</span>
(<span style="color: #859900;">when</span> (string-equal system-type <span style="color: #2aa198;">"darwin"</span>)
  (<span style="color: #859900;">setq</span> helm-man-format-switches <span style="color: #2aa198;">"%s"</span>))
(add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)
</pre>
</div>

<p>
Use Unix <code>find</code> in helm interface: <code>&lt;helm-prefix&gt; /</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">helm find</span>
(global-set-key (kbd <span style="color: #2aa198;">"M-g /"</span>) 'helm-find)
</pre>
</div>

<p>
Use Unix <code>locate</code> in helm interface: <code>&lt;helm-prefix&gt; l</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">helm for system command "locate"</span>
(<span style="color: #859900;">setq</span> helm-locate-fuzzy-match t)
</pre>
</div>

<p>
Show Unix <code>top</code> in helm interface: <code>&lt;helm-prefix&gt; t</code> <br />
Functions:
</p>
<ul class="org-ul">
<li><code>[C-c C-u]</code>  : refresh "helm-top"</li>
<li><code>[M-c]</code>           : sort by <code>shell commands</code></li>
<li><code>[M-p]</code>           : sort by <code>cpu usage</code></li>
<li><code>[M-u]</code>           : sort by <code>user</code></li>
<li><code>[M-m]</code>           : sort by <code>memory</code></li>
</ul>

<p>
Use Unix GNU-calc command in helm interface: <code>&lt;helm-prefix&gt; C-,</code>
</p>
</div>
</div>
<div id="outline-container-orgc5489a5" class="outline-4">
<h4 id="orgc5489a5"><span class="section-number-4">1.3.7</span> miscellanies</h4>
<div class="outline-text-4" id="text-1-3-7">
<p>
Use helm to build regexp, test them interactively: <code>&lt;helm-prefix&gt; r</code>    <br />
Functions:
</p>
<ul class="org-ul">
<li><code>[F1]</code> save the regexp as a string in <code>kill-ring</code></li>
<li><code>[F2]</code> invoke <code>query-replace</code> with curent regexp to be replace</li>
<li><code>[F3]</code> save the regexp as is in the current helm prompt</li>
</ul>

<p>
Quickly view and copy hexadecimal values of colors: <code>&lt;helm-prefix&gt; c</code>
</p>

<p>
Instant eval Emacs Lisp expression in helm buffer: <code>&lt;helm-prefix&gt; C-:</code>
</p>
<pre class="example">
(global-set-key (kbd "C-c h M-:") 'helm-eval-expression-with-eldoc)
</pre>
</div>
</div>
</div>
