_emacs.d/init/init-helm.el

(setq helm-semantic-fuzzy-match t
      helm-imenu-fuzzy-match    t)
(with-eval-after-load 'helm-semantic      ;; default: C, python, elisp
  (push '(c++-mode . semantic-format-tag-summarize) helm-semantic-display-style)
  (push '(c-mode . semantic-format-tag-summarize) helm-semantic-display-style)
  (push '(emacs-lisp-mode . semantic-format-tag-summarize) helm-semantic-display-style)
  (nbutlast helm-semantic-display-style 2)) ;; remove the default elisp setting

;; helm for Emacs help functions
(setq helm-apropos-fuzzy-match t)

(setq helm-lisp-fuzzy-completion t)

;; helm for system man page
(when (string-equal system-type "darwin")
  (setq helm-man-format-switches "%s"))
(add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)

;; helm find
(global-set-key (kbd "M-g /") 'helm-find)

;; helm for system command "locate"
(setq helm-locate-fuzzy-match t)

;; ===============================================================
