_emacs.d/init/init-helm.org
** Summary of Keybindings

|---------------+---------------------------------------------+-----------------------------------------------------------------------------|
| Keybindings   | Commands                                    | Descriptions                                                                |
|---------------+---------------------------------------------+-----------------------------------------------------------------------------|
| =M-x=         | helm-M-x                                    | List commands                                                               |
| =M-y=         | helm-show-kill-ring                         | Shows the content of the kill ring                                          |
| =C-x b=       | helm-mini                                   | Shows open buffers, recently opened files                                   |
| =C-x C-f=     | helm-find-files                             | The helm version for find-file                                              |
| =C-s=         | helm-ff-run-grep                            | Run grep from within helm-find-files                                        |
| =C-o=         | Switch between Helm sources in helm session |                                                                             |
| =C-c h i=     | helm-semantic-or-imenu                      | Helm interface to semantic/imenu                                            |
| =C-c h m=     | helm-man-woman                              | Jump to any man entry                                                       |
| =C-c h /=     | helm-find                                   | Helm interface to find                                                      |
| =C-c h l=     | helm-locate                                 | Helm interface to locate                                                    |
| =C-c h o=     | helm-occur                                  | Similar to occur                                                            |
| =C-c h a=     | helm-apropos                                | Describes commands, functions, variables                                    |
| =C-c h h g=   | helm-info-gnus                              |                                                                             |
| =C-c h h i=   | helm-info-at-point                          |                                                                             |
| =C-c h h r=   | helm-info-emacs                             |                                                                             |
| =C-c h <tab>= | helm-lisp-completion-at-point               | Provides a list of available functions                                      |
| =C-c h b=     | helm-resume                                 | Resumes a previous helm session                                             |
| =C-h SPC=     | helm-all-mark-rings                         | Views content of local and global mark rings                                |
| =C-c h r=     | helm-regex                                  | Visualizes regex matches                                                    |
| =C-c h x=     | helm-register                               | Shows content of registers                                                  |
| =C-c h t=     | helm-top                                    | Helm interface to top                                                       |
| =C-c h s=     | helm-surfraw                                | Command line interface to many web search engines                           |
| =C-c h g=     | helm-google-suggest                         | Interactively enter search terms and get results from Google in helm buffer |
| =C-c h c=     | helm-color                                  | Lists all available faces                                                   |
| =C-c h M-:=   | helm-eval-expression-with-eldoc             | Get instant results for Emacs lisp expressions in the helm buffer           |
| =C-c h C-,=   | helm-calcul-expression                      | Helm interface to calc                                                      |
| =C-c C-l=     | helm-eshell-history                         | Interface to eshell history                                                 |
| =C-c C-l=     | helm-comint-input-ring                      | Interface to shell history                                                  |
| =C-c C-l=     | helm-mini-buffer-history                    | Interface to mini-buffer history                                            |
|---------------+---------------------------------------------+-----------------------------------------------------------------------------|


* Helm-Swoop: more powerful helm-occur

** Install packages on Emacs

Adding a header for the exported =.el= file.
#+BEGIN_SRC emacs-lisp
  ;; ===============================================================
  ;; Settings for /helm-swoop/
  ;; ===============================================================
#+END_SRC

Install the additional packages to support the =helm-swoop= package
#+BEGIN_SRC emacs-lisp
  ;; Install required packages for more functions
  (setq custom/helm-swoop-packages
        '(helm-swoop))
  (custom/install-packages custom/helm-swoop-packages)

  (require 'helm-swoop)
#+END_SRC

