_emacs.d/init/readme/init-helm.html

<div id="outline-container-org7077be1" class="outline-3">
<h3 id="org7077be1"><span class="section-number-3">1.4</span> Summary of Keybindings</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybindings</th>
<th scope="col" class="org-left">Commands</th>
<th scope="col" class="org-left">Descriptions</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-x</code></td>
<td class="org-left">helm-M-x</td>
<td class="org-left">List commands</td>
</tr>

<tr>
<td class="org-left"><code>M-y</code></td>
<td class="org-left">helm-show-kill-ring</td>
<td class="org-left">Shows the content of the kill ring</td>
</tr>

<tr>
<td class="org-left"><code>C-x b</code></td>
<td class="org-left">helm-mini</td>
<td class="org-left">Shows open buffers, recently opened files</td>
</tr>

<tr>
<td class="org-left"><code>C-x C-f</code></td>
<td class="org-left">helm-find-files</td>
<td class="org-left">The helm version for find-file</td>
</tr>

<tr>
<td class="org-left"><code>C-s</code></td>
<td class="org-left">helm-ff-run-grep</td>
<td class="org-left">Run grep from within helm-find-files</td>
</tr>

<tr>
<td class="org-left"><code>C-o</code></td>
<td class="org-left">Switch between Helm sources in helm session</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>C-c h i</code></td>
<td class="org-left">helm-semantic-or-imenu</td>
<td class="org-left">Helm interface to semantic/imenu</td>
</tr>

<tr>
<td class="org-left"><code>C-c h m</code></td>
<td class="org-left">helm-man-woman</td>
<td class="org-left">Jump to any man entry</td>
</tr>

<tr>
<td class="org-left"><code>C-c h /</code></td>
<td class="org-left">helm-find</td>
<td class="org-left">Helm interface to find</td>
</tr>

<tr>
<td class="org-left"><code>C-c h l</code></td>
<td class="org-left">helm-locate</td>
<td class="org-left">Helm interface to locate</td>
</tr>

<tr>
<td class="org-left"><code>C-c h o</code></td>
<td class="org-left">helm-occur</td>
<td class="org-left">Similar to occur</td>
</tr>

<tr>
<td class="org-left"><code>C-c h a</code></td>
<td class="org-left">helm-apropos</td>
<td class="org-left">Describes commands, functions, variables</td>
</tr>

<tr>
<td class="org-left"><code>C-c h h g</code></td>
<td class="org-left">helm-info-gnus</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>C-c h h i</code></td>
<td class="org-left">helm-info-at-point</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>C-c h h r</code></td>
<td class="org-left">helm-info-emacs</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>C-c h &lt;tab&gt;</code></td>
<td class="org-left">helm-lisp-completion-at-point</td>
<td class="org-left">Provides a list of available functions</td>
</tr>

<tr>
<td class="org-left"><code>C-c h b</code></td>
<td class="org-left">helm-resume</td>
<td class="org-left">Resumes a previous helm session</td>
</tr>

<tr>
<td class="org-left"><code>C-h SPC</code></td>
<td class="org-left">helm-all-mark-rings</td>
<td class="org-left">Views content of local and global mark rings</td>
</tr>

<tr>
<td class="org-left"><code>C-c h r</code></td>
<td class="org-left">helm-regex</td>
<td class="org-left">Visualizes regex matches</td>
</tr>

<tr>
<td class="org-left"><code>C-c h x</code></td>
<td class="org-left">helm-register</td>
<td class="org-left">Shows content of registers</td>
</tr>

<tr>
<td class="org-left"><code>C-c h t</code></td>
<td class="org-left">helm-top</td>
<td class="org-left">Helm interface to top</td>
</tr>

<tr>
<td class="org-left"><code>C-c h s</code></td>
<td class="org-left">helm-surfraw</td>
<td class="org-left">Command line interface to many web search engines</td>
</tr>

<tr>
<td class="org-left"><code>C-c h g</code></td>
<td class="org-left">helm-google-suggest</td>
<td class="org-left">Interactively enter search terms and get results from Google in helm buffer</td>
</tr>

<tr>
<td class="org-left"><code>C-c h c</code></td>
<td class="org-left">helm-color</td>
<td class="org-left">Lists all available faces</td>
</tr>

<tr>
<td class="org-left"><code>C-c h M-:</code></td>
<td class="org-left">helm-eval-expression-with-eldoc</td>
<td class="org-left">Get instant results for Emacs lisp expressions in the helm buffer</td>
</tr>

<tr>
<td class="org-left"><code>C-c h C-,</code></td>
<td class="org-left">helm-calcul-expression</td>
<td class="org-left">Helm interface to calc</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-l</code></td>
<td class="org-left">helm-eshell-history</td>
<td class="org-left">Interface to eshell history</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-l</code></td>
<td class="org-left">helm-comint-input-ring</td>
<td class="org-left">Interface to shell history</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-l</code></td>
<td class="org-left">helm-mini-buffer-history</td>
<td class="org-left">Interface to mini-buffer history</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org83bef53" class="outline-2">
<h2 id="org83bef53"><span class="section-number-2">2</span> Helm-Swoop: more powerful helm-occur</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org073bcf9" class="outline-3">
<h3 id="org073bcf9"><span class="section-number-3">2.1</span> Install packages on Emacs</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Adding a header for the exported <code>.el</code> file.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">===============================================================</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Settings for /helm-swoop/</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">===============================================================</span>
</pre>
</div>

<p>
Install the additional packages to support the <code>helm-swoop</code> package
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Install required packages for more functions</span>
(<span style="color: #859900;">setq</span> custom/helm-swoop-packages
      '(helm-swoop))
(custom/install-packages custom/helm-swoop-packages)

(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">helm-swoop</span>)
</pre>
</div>
</div>
</div>
