_emacs.d/init/init-helm.el
;; Settings for /helm-swoop/
;; ===============================================================

;; Install required packages for more functions
(setq custom/helm-swoop-packages
      '(helm-swoop))
(custom/install-packages custom/helm-swoop-packages)

(require 'helm-swoop)
