_emacs.d/init/init-helm.org
** Keybindings

Basic keybindings that globally call =helm-swoop=:

#+BEGIN_SRC emacs-lisp
  ;; Change the keybinds to whatever you like :)
  (global-set-key (kbd "M-g o") 'helm-swoop)    ; default "M-i"
  (global-set-key (kbd "C-c h o") 'helm-swoop)
  (global-set-key (kbd "M-g O") 'helm-swoop-back-to-last-point) ;default "M-I"
  (global-set-key (kbd "C-c M-o") 'helm-multi-swoop) ;default "C-c M-i"
  (global-set-key (kbd "C-x M-o") 'helm-multi-swoop-all) ;default "C-x M-i"
#+END_SRC

More keybindings that work in the sessions of =helm-swoop=:

#+BEGIN_SRC emacs-lisp
  ;; When doing isearch, hand the word over to helm-swoop
  (define-key isearch-mode-map (kbd "M-i") 'helm-swoop-from-isearch)
  ;; From helm-swoop to helm-multi-swoop-all
  (define-key helm-swoop-map (kbd "M-i") 'helm-multi-swoop-all-from-helm-swoop)
  ;; When doing evil-search, hand the word over to helm-swoop
  ;; (define-key evil-motion-state-map (kbd "M-i") 'helm-swoop-from-evil-search)

  ;; Instead of helm-multi-swoop-all, use helm-multi-swoop-current-mode
  (define-key helm-swoop-map (kbd "M-m")
    'helm-multi-swoop-current-mode-from-helm-swoop)

  ;; Move up and down like isearch
  (define-key helm-swoop-map (kbd "C-r") 'helm-previous-line)
  (define-key helm-swoop-map (kbd "C-s") 'helm-next-line)
  (define-key helm-multi-swoop-map (kbd "C-r") 'helm-previous-line)
  (define-key helm-multi-swoop-map (kbd "C-s") 'helm-next-line)
#+END_SRC

** Configurations on Features
#+BEGIN_SRC emacs-lisp
  ;; Save buffer when helm-multi-swoop-edit complete
  (setq helm-multi-swoop-edit-save t)

  ;; If this value is t, split window inside the current window
  (setq helm-swoop-split-with-multiple-windows t)

  ;; Split direcion. 'split-window-vertically or 'split-window-horizontally
  (setq helm-swoop-split-direction 'split-window-vertically)

  ;; If nil, you can slightly boost invoke speed in exchange for text color
  (setq helm-swoop-speed-or-color t)

  ;; ;; Go to the opposite side of line from the end or beginning of line
  (setq helm-swoop-move-to-line-cycle t)

  ;; Optional face for line numbers
  ;; Face name is `helm-swoop-line-number-face`
  (setq helm-swoop-use-line-number-face t)
#+END_SRC


* Exploring large projects with Projectile and Helm Projectile

** Install Emacs packages

Adding a header for the exported =.el= file.
#+BEGIN_SRC emacs-lisp
  ;; ===============================================================
  ;; Project Management via Projectile
  ;; ===============================================================
#+END_SRC

Install the additional packages to support the =helm-projectile= package
#+BEGIN_SRC emacs-lisp
  ;; Install required packages for more functions
  (setq custom/proj-packages
        '(projectile
          helm-projectile))
  (custom/install-packages custom/proj-packages)
#+END_SRC

** Package: =projectile=

#+BEGIN_SRC emacs-lisp
  ;; /projectile/: project management
  (require 'projectile)
  (projectile-global-mode)
  (setq projectile-enable-caching t)
#+END_SRC

To refresh the whole cache, use ~projectile-invalidate-cahe~.

** Package: =helm-proctile=
*** Enable helm-projectile

#+BEGIN_SRC emacs-lisp
  ;; /helm-projectile/: browse via helm
  (require 'helm-projectile)
  (helm-projectile-on)
  (setq projectile-completion-system 'helm)
#+END_SRC

*** Basic commands

-  ~helm-projectile-switch-project~         : =C-c p p=
-  ~helm-projectile-find-file~              : =C-c p f=
-  ~helm-projectile-find-file-dwim~         : =C-c p g=
-  ~helm-projectile-fi-other-file~        : =C-c p a=
-  Virtual directory manager
   - create a Dired buffer of project files : =C-c f=
   - add more files to the Dired buffer     : =C-c a=
-  ~helm-projectile-ack~                    : =C-c p s a=

