_emacs.d/init/readme/init-helm.html

<div id="outline-container-orgd50b22b" class="outline-3">
<h3 id="orgd50b22b"><span class="section-number-3">2.2</span> Keybindings</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Basic keybindings that globally call <code>helm-swoop</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Change the keybinds to whatever you like :)</span>
(global-set-key (kbd <span style="color: #2aa198;">"M-g i"</span>) 'helm-swoop)    <span style="color: #93a1a1; font-style: italic;">; </span><span style="color: #93a1a1; font-style: italic;">default "M-i"</span>
(global-set-key (kbd <span style="color: #2aa198;">"C-c h o"</span>) 'helm-swoop)
(global-set-key (kbd <span style="color: #2aa198;">"M-g I"</span>) 'helm-swoop-back-to-last-point) <span style="color: #93a1a1; font-style: italic;">;</span><span style="color: #93a1a1; font-style: italic;">default "M-I"</span>
(global-set-key (kbd <span style="color: #2aa198;">"C-c M-i"</span>) 'helm-multi-swoop) <span style="color: #93a1a1; font-style: italic;">;</span><span style="color: #93a1a1; font-style: italic;">default "C-c M-i"</span>
(global-set-key (kbd <span style="color: #2aa198;">"C-x M-i"</span>) 'helm-multi-swoop-all) <span style="color: #93a1a1; font-style: italic;">;</span><span style="color: #93a1a1; font-style: italic;">default "C-x M-i"</span>
</pre>
</div>

<p>
More keybindings that work in the sessions of <code>helm-swoop</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">When doing isearch, hand the word over to helm-swoop</span>
(define-key isearch-mode-map (kbd <span style="color: #2aa198;">"M-i"</span>) 'helm-swoop-from-isearch)
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">From helm-swoop to helm-multi-swoop-all</span>
(define-key helm-swoop-map (kbd <span style="color: #2aa198;">"M-i"</span>) 'helm-multi-swoop-all-from-helm-swoop)
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">When doing evil-search, hand the word over to helm-swoop</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(define-key evil-motion-state-map (kbd "M-i") 'helm-swoop-from-evil-search)</span>

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Instead of helm-multi-swoop-all, use helm-multi-swoop-current-mode</span>
(define-key helm-swoop-map (kbd <span style="color: #2aa198;">"M-m"</span>)
  'helm-multi-swoop-current-mode-from-helm-swoop)

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Move up and down like isearch</span>
(define-key helm-swoop-map (kbd <span style="color: #2aa198;">"C-r"</span>) 'helm-previous-line)
(define-key helm-swoop-map (kbd <span style="color: #2aa198;">"C-s"</span>) 'helm-next-line)
(define-key helm-multi-swoop-map (kbd <span style="color: #2aa198;">"C-r"</span>) 'helm-previous-line)
(define-key helm-multi-swoop-map (kbd <span style="color: #2aa198;">"C-s"</span>) 'helm-next-line)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfdead47" class="outline-3">
<h3 id="orgfdead47"><span class="section-number-3">2.3</span> Configurations on Features</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Save buffer when helm-multi-swoop-edit complete</span>
(<span style="color: #859900;">setq</span> helm-multi-swoop-edit-save t)

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">If this value is t, split window inside the current window</span>
(<span style="color: #859900;">setq</span> helm-swoop-split-with-multiple-windows nil)

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Split direcion. 'split-window-vertically or 'split-window-horizontally</span>
(<span style="color: #859900;">setq</span> helm-swoop-split-direction 'split-window-vertically)

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">If nil, you can slightly boost invoke speed in exchange for text color</span>
(<span style="color: #859900;">setq</span> helm-swoop-speed-or-color t)

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">;; Go to the opposite side of line from the end or beginning of line</span>
(<span style="color: #859900;">setq</span> helm-swoop-move-to-line-cycle t)

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Optional face for line numbers</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Face name is `helm-swoop-line-number-face`</span>
(<span style="color: #859900;">setq</span> helm-swoop-use-line-number-face t)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgd229348" class="outline-2">
<h2 id="orgd229348"><span class="section-number-2">3</span> Exploring large projects with Projectile and Helm Projectile</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org678bcf4" class="outline-3">
<h3 id="org678bcf4"><span class="section-number-3">3.1</span> Install Emacs packages</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Adding a header for the exported <code>.el</code> file.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">===============================================================</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Project Management via Projectile</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">===============================================================</span>
</pre>
</div>

<p>
Install the additional packages to support the <code>helm-projectile</code> package
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Install required packages for more functions</span>
(<span style="color: #859900;">setq</span> custom/proj-packages
      '(projectile
        helm-projectile))
(custom/install-packages custom/proj-packages)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c02c5c" class="outline-3">
<h3 id="org8c02c5c"><span class="section-number-3">3.2</span> Package: <code>projectile</code></h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">/projectile/: project management</span>
(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">projectile</span>)
(projectile-global-mode)
(<span style="color: #859900;">setq</span> projectile-enable-caching t)
</pre>
</div>

<p>
To refresh the whole cache, use <code>projectile-invalidate-cahe</code>.
</p>
</div>
</div>

<div id="outline-container-org115c600" class="outline-3">
<h3 id="org115c600"><span class="section-number-3">3.3</span> Package: <code>helm-proctile</code></h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org1f34b63" class="outline-4">
<h4 id="org1f34b63"><span class="section-number-4">3.3.1</span> Enable helm-projectile</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">/helm-projectile/: browse via helm</span>
(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">helm-projectile</span>)
(helm-projectile-on)
(<span style="color: #859900;">setq</span> projectile-completion-system 'helm)
</pre>
</div>
</div>
</div>

<div id="outline-container-org14768fe" class="outline-4">
<h4 id="org14768fe"><span class="section-number-4">3.3.2</span> Basic commands</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li><code>helm-projectile-switch-project</code>         : <code>C-c p p</code></li>
<li><code>helm-projectile-find-file</code>              : <code>C-c p f</code></li>
<li><code>helm-projectile-find-file-dwim</code>         : <code>C-c p g</code></li>
<li><code>helm-projectile-fi-other-file</code>        : <code>C-c p a</code></li>
<li>Virtual directory manager
<ul class="org-ul">
<li>create a Dired buffer of project files : <code>C-c f</code></li>
<li>add more files to the Dired buffer     : <code>C-c a</code></li>
</ul></li>
<li><code>helm-projectile-ack</code>                    : <code>C-c p s a</code></li>
</ul>
</div>
</div>
