_emacs.d/init/init-helm.org
*** All-in-one command
_Command_: =helm-projectile=, =C-c p h=

_Usage_: this command, by default, is the combination of these 5 commands:

-   ~helm-projectile-switch-to-buffer~
-   ~helm-projectile-find-file~
-   ~helm-projectile-switch-project~

*** Enter project portal
_Command_: =helm-projectile-switch-project=, =C-c p p=

_Usage_: This is the very first command you need to use before using other
commands, because it is the entrance to all of your projects and the only
command that can be used outside of a project, aside from
~helm-projectile-find-file-in-known-projects~. The command lists all visited
projects. If you first use Projectile, you have to visit at least a project
supported by Projectile to let it remember the location of this project. The
next time you won't have to manually navigate to that project but jump to it
instantly using ~helm-projectile-switch-project~.

#+BEGIN_SRC emacs-lisp
  (setq projectile-switch-project-action 'helm-projectile)
#+END_SRC

List of actions in the session:
-   open Dired in project's directorzyue/      =C-d=
-   open project root in vc-dir or magit:   =M-g=
-   switch to Esell; open a project Eshell: =M-e=
-   grep in projects (prefix =C-u= to recursive grep):  =C-s=
-   compile project, run =compile= at the project root: =C-c=
-   remove projects (delete marked projects from the list of known projects): =M-D=

*** File management
**** Command: ~helm-projectile-find-file~, =C-c p f=

_Usage_: This command lists all files in a project for users to narrow down to
wanted files. Some frequently used actions that cover open, rename, copy,
delete,search and other miscelaneous operations. Once you mastered the actions
of helm-projectile-find-file, you master the actions of other commands as well
since the actions of other commands are just a subset of
helm-projectile-find-file actions. All the key bindings associated with actions
are only available while a Helm buffer is active. You can think of actions as an
mini version of M-x: only applicable commands are listed, and even those
commands have key bindings. Prefix argument can be applied, when possible.

*Open*
-   Find file: =RET= to open files; =M-SPC= to mark files; =M-a= to mark all
-   Find file other window: =C-c o=
-   Find file as root: =C-c r=

*Move and Reanme*
-   Rename files: =M-R=; =M-SPC= to mark files

*Copy and Delete*
-   Copy files: =M-C=
-   Delete files: =M-D= or =C-c d=

*Search and Replace*
-   Grep files: =C-s= (add prefix =C-u= for resursive grep)
-   Zgrep: =M-g z= (add prefix =C-u= for resursive grep), invoking grep on cpmressed files
-   Locate (using Unix ~locate~): =C-x C-f= (add =C-u= to specify locate db)

*Miscellanies*
-   Insert as org link (C-c @): Insert the current file that highlighted as an Org link.
-   Ediff files: =C-==
-   Ediff Merge files: =C-c ==, when exactly two files are selected
-   Etags: =M-.=, invoking Etags using helm
-   Switch to Eshell: =M-e=
-   Eshell command on files: =M-!=
-   Symlink files: =M-S=, using absolute path
-   Relsymlink files: using relative path
-   Hardlink files: =M-H=
-   Checksum file: generate file checksum and insert checksum in ~kill-ring~
-   Print file: =C-c p= (add =C-u= to refresh)

**** Command: ~helm-projectile-find-file-in-known-projects~, =C-c p F=

**** Command: ~helm-projectile-find-file-dwim~, =C-c p g=

**** Command: ~helm-projectile-find-dir~, =C-c p d=

+   open Dired in project's directory
+   switch to Eshell: =M-e=
+   grep in projects: =C-s= (add prefix =C-u= for recurse grep)

**** Command: ~helm-projectile-recentf~, =C-c p e=

**** Command: ~helm-projectile-find-other-file~, =C-c p a=

_Usage_: switch between files with the same name but different extensions.  With
prefix argument =C-u=, enable flex-matching that match any file that contains
contains the name of current file.

_Variable_: ~projectile-other-file-alist~

#+BEGIN_SRC emacs-lisp
  ;; adding the switch between html <-> js
  ;; html -> js
  (add-to-list 'projectile-other-file-alist '("html" "js"))
  ;; js -> html
  (add-to-list 'projectile-other-file-alist '("js" "html"))
#+END_SRC

**** [IMPORTANT] Caching
-   command: ~projectile-invalidate-cache~, =C-c p i=
-   command: ~projectile-cache-current-file~, =C-c p z=
-   command: ~projectile-purge-file-from-cache~
-   command: ~projectile-purge-dir-from-cache~

*** Virtual directory manager

When in a *helm-projectile-find-file* session:
-   create Dired buffer from files: =C-c f=
-   add files to Dired buffer: =C-c a=
-   remove entry from from Dired buffer: =C-c d=

*** Buffer management:

_Command_: ~helm-projectile-switch-project~ =C-c p b=

_Usage_: List all opened buffers in current project. The command has a similar
subset of actions in ~helm-projectile-find-file~, so once you mastered the
actions in ~helm-projectile-find-file~, except instead of opening files, you
open buffers instead.

*** Search in project

