_emacs.d/init/readme/init-helm.html

<div id="outline-container-orgd30c42e" class="outline-4">
<h4 id="orgd30c42e"><span class="section-number-4">3.3.3</span> All-in-one command</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
<span class="underline">Command</span>: <code>helm-projectile</code>, <code>C-c p h</code>
</p>

<p>
<span class="underline">Usage</span>: this command, by default, is the combination of these 5 commands:
</p>

<ul class="org-ul">
<li><code>helm-projectile-switch-to-buffer</code></li>
<li><code>helm-projectile-find-file</code></li>
<li><code>helm-projectile-switch-project</code></li>
</ul>
</div>
</div>

<div id="outline-container-org835eaa4" class="outline-4">
<h4 id="org835eaa4"><span class="section-number-4">3.3.4</span> Enter project portal</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
<span class="underline">Command</span>: <code>helm-projectile-switch-project</code>, <code>C-c p p</code>
</p>

<p>
<span class="underline">Usage</span>: This is the very first command you need to use before using other
commands, because it is the entrance to all of your projects and the only
command that can be used outside of a project, aside from
<code>helm-projectile-find-file-in-known-projects</code>. The command lists all visited
projects. If you first use Projectile, you have to visit at least a project
supported by Projectile to let it remember the location of this project. The
next time you won't have to manually navigate to that project but jump to it
instantly using <code>helm-projectile-switch-project</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #859900;">setq</span> projectile-switch-project-action 'helm-projectile)
</pre>
</div>

<p>
List of actions in the session:
</p>
<ul class="org-ul">
<li>open Dired in project's directory:      <code>C-d</code></li>
<li>open project root in vc-dir or magit:   <code>M-g</code></li>
<li>switch to Esell; open a project Eshell: <code>M-e</code></li>
<li>grep in projects (prefix <code>C-u</code> to recursive grep):  <code>C-s</code></li>
<li>compile project, run <code>compile</code> at the project root: <code>C-c</code></li>
<li>remove projects (delete marked projects from the list of known projects): <code>M-D</code></li>
</ul>
</div>
</div>

<div id="outline-container-org6fc8164" class="outline-4">
<h4 id="org6fc8164"><span class="section-number-4">3.3.5</span> File management</h4>
<div class="outline-text-4" id="text-3-3-5">
</div>
<div id="outline-container-org93c3ff8" class="outline-5">
<h5 id="org93c3ff8"><span class="section-number-5">3.3.5.1</span> Command: <code>helm-projectile-find-file</code>, <code>C-c p f</code></h5>
<div class="outline-text-5" id="text-3-3-5-1">
<p>
<span class="underline">Usage</span>: This command lists all files in a project for users to narrow down to
wanted files. Some frequently used actions that cover open, rename, copy,
delete,search and other miscelaneous operations. Once you mastered the actions
of helm-projectile-find-file, you master the actions of other commands as well
since the actions of other commands are just a subset of
helm-projectile-find-file actions. All the key bindings associated with actions
are only available while a Helm buffer is active. You can think of actions as an
mini version of M-x: only applicable commands are listed, and even those
commands have key bindings. Prefix argument can be applied, when possible.
</p>

<p>
<b>Open</b>
</p>
<ul class="org-ul">
<li>Find file: <code>RET</code> to open files; <code>M-SPC</code> to mark files; <code>M-a</code> to mark all</li>
<li>Find file other window: <code>C-c o</code></li>
<li>Find file as root: <code>C-c r</code></li>
</ul>

<p>
<b>Move and Reanme</b>
</p>
<ul class="org-ul">
<li>Rename files: <code>M-R</code>; <code>M-SPC</code> to mark files</li>
</ul>

<p>
<b>Copy and Delete</b>
</p>
<ul class="org-ul">
<li>Copy files: <code>M-C</code></li>
<li>Delete files: <code>M-D</code> or <code>C-c d</code></li>
</ul>

<p>
<b>Search and Replace</b>
</p>
<ul class="org-ul">
<li>Grep files: <code>C-s</code> (add prefix <code>C-u</code> for resursive grep)</li>
<li>Zgrep: <code>M-g z</code> (add prefix <code>C-u</code> for resursive grep), invoking grep on cpmressed files</li>
<li>Locate (using Unix <code>locate</code>): <code>C-x C-f</code> (add <code>C-u</code> to specify locate db)</li>
</ul>

<p>
<b>Miscellanies</b>
</p>
<ul class="org-ul">
<li>Insert as org link (C-c @): Insert the current file that highlighted as an Org link.</li>
<li>Ediff files: <code>C-=</code></li>
<li>Ediff Merge files: <code>C-c =</code>, when exactly two files are selected</li>
<li>Etags: <code>M-.</code>, invoking Etags using helm</li>
<li>Switch to Eshell: <code>M-e</code></li>
<li>Eshell command on files: <code>M-!</code></li>
<li>Symlink files: <code>M-S</code>, using absolute path</li>
<li>Relsymlink files: using relative path</li>
<li>Hardlink files: <code>M-H</code></li>
<li>Checksum file: generate file checksum and insert checksum in <code>kill-ring</code></li>
<li>Print file: <code>C-c p</code> (add <code>C-u</code> to refresh)</li>
</ul>
</div>
</div>

<div id="outline-container-org8c04bc7" class="outline-5">
<h5 id="org8c04bc7"><span class="section-number-5">3.3.5.2</span> Command: <code>helm-projectile-find-file-in-known-projects</code>, <code>C-c p F</code></h5>
</div>

<div id="outline-container-org5e249d5" class="outline-5">
<h5 id="org5e249d5"><span class="section-number-5">3.3.5.3</span> Command: <code>helm-projectile-find-file-dwim</code>, <code>C-c p g</code></h5>
</div>

<div id="outline-container-orgddeae70" class="outline-5">
<h5 id="orgddeae70"><span class="section-number-5">3.3.5.4</span> Command: <code>helm-projectile-find-dir</code>, <code>C-c p d</code></h5>
<div class="outline-text-5" id="text-3-3-5-4">
<ul class="org-ul">
<li>open Dired in project's directory</li>
<li>switch to Eshell: <code>M-e</code></li>
<li>grep in projects: <code>C-s</code> (add prefix <code>C-u</code> for recurse grep)</li>
</ul>
</div>
</div>

<div id="outline-container-org390a726" class="outline-5">
<h5 id="org390a726"><span class="section-number-5">3.3.5.5</span> Command: <code>helm-projectile-recentf</code>, <code>C-c p e</code></h5>
</div>

<div id="outline-container-orgeaddbe0" class="outline-5">
<h5 id="orgeaddbe0"><span class="section-number-5">3.3.5.6</span> Command: <code>helm-projectile-find-other-file</code>, <code>C-c p a</code></h5>
<div class="outline-text-5" id="text-3-3-5-6">
<p>
<span class="underline">Usage</span>: switch between files with the same name but different extensions.  With
prefix argument <code>C-u</code>, enable flex-matching that match any file that contains
contains the name of current file.
</p>

<p>
<span class="underline">Variable</span>: <code>projectile-other-file-alist</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">adding the switch between html &lt;-&gt; js</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">html -&gt; js</span>
(add-to-list 'projectile-other-file-alist '(<span style="color: #2aa198;">"html"</span> <span style="color: #2aa198;">"js"</span>))
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">js -&gt; html</span>
(add-to-list 'projectile-other-file-alist '(<span style="color: #2aa198;">"js"</span> <span style="color: #2aa198;">"html"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org900b9f9" class="outline-5">
<h5 id="org900b9f9"><span class="section-number-5">3.3.5.7</span> [IMPORTANT] Caching</h5>
<div class="outline-text-5" id="text-3-3-5-7">
<ul class="org-ul">
<li>command: <code>projectile-invalidate-cache</code>, <code>C-c p i</code></li>
<li>command: <code>projectile-cache-current-file</code>, <code>C-c p z</code></li>
<li>command: <code>projectile-purge-file-from-cache</code></li>
<li>command: <code>projectile-purge-dir-from-cache</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3864504" class="outline-4">
<h4 id="org3864504"><span class="section-number-4">3.3.6</span> Virtual directory manager</h4>
<div class="outline-text-4" id="text-3-3-6">
<p>
When in a <b>helm-projectile-find-file</b> session:
</p>
<ul class="org-ul">
<li>create Dired buffer from files: <code>C-c f</code></li>
<li>add files to Dired buffer: <code>C-c a</code></li>
<li>remove entry from from Dired buffer: <code>C-c d</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgfc9ffe0" class="outline-4">
<h4 id="orgfc9ffe0"><span class="section-number-4">3.3.7</span> Buffer management:</h4>
<div class="outline-text-4" id="text-3-3-7">
<p>
<span class="underline">Command</span>: <code>helm-projectile-switch-project</code> <code>C-c p b</code>
</p>

<p>
<span class="underline">Usage</span>: List all opened buffers in current project. The command has a similar
subset of actions in <code>helm-projectile-find-file</code>, so once you mastered the
actions in <code>helm-projectile-find-file</code>, except instead of opening files, you
open buffers instead.
</p>
</div>
</div>

<div id="outline-container-org34f8966" class="outline-4">
<h4 id="org34f8966"><span class="section-number-4">3.3.8</span> Search in project</h4>
<div class="outline-text-4" id="text-3-3-8">
</div>
