_emacs.d/init/init-helm.el

;; adding the switch between html <-> js
;; html -> js
(add-to-list 'projectile-other-file-alist '("html" "js"))
;; js -> html
(add-to-list 'projectile-other-file-alist '("js" "html"))
