_emacs.d/init/init-helm.org
**** Command: ~helm-projectile-grep~, =C-c p s g=

This is a replacement command for ~projectile-grep~ that uses Helm
interface. When a symbol is at point, this command uses that symbol and search
at project root for every occurrence of this symbol in all non-ignored files in
project. If a region is active, use the region instead.

#+BEGIN_SRC emacs-lisp
  (eval-after-load 'grep
    '(when (boundp 'grep-find-ignored-files)
       (add-to-list 'grep-find-ignored-files "run")
       (add-to-list 'grep-find-ignored-directories "obj")))
#+END_SRC

_Configuration_:

You can specify directory to exclude when searching by customize either one of
these variables:

-   =grep-find-ignored-files=: list of file names which rgrep and lgrep shall
    exclude. ~helm-projectile-grep~ also uses this variable.

-   =grep-find-ignored-directories=: list of names of sub-directories which
    rgrep shall not recurse into. ~helm-projectile-grep~ also uses this variable.

-   =projectile-globally-ignored-files=: list of files globally ignored by
    Projectile.

-   =projectile-globally-ignored-directories=: list of directories globally
    ignored by Projectile.

**** Command: ~helm-projectile-ack~, =C-c p s a=

_Configuration_:

-   =grep-find-ignored-files=: list of file names which rgrep and lgrep shall
    exclude, and ~helm-projectile-ack~ also uses this variable.

-   =grep-find-ignored-directories=: list of names of sub-directories which
    rgrep shall not recurse into. ~helm-projectile-ack~ also uses this variable.

-   =projectile-globally-ignored-files=: a list of files globally ignored by
    Projectile.

-   =projectile-globally-ignored-directories=: a list of directories globally
    ignored by Projectile.

**** Command: ~helm-projectile-ag~, =C-c p s s=

_Configuration_:

-   =grep-find-ignored-files=: list of file names which rgrep and lgrep shall
    exclude, and ~helm-projectile-ack~ also uses this variable.

-   =grep-find-ignored-directories=: list of names of sub-directories which
    rgrep shall not recurse into. ~helm-projectile-ack~ also uses this variable.

-   =projectile-globally-ignored-files=: a list of files globally ignored by
    Projectile.

-   =projectile-globally-ignored-directories=: a list of directories globally
    ignored by Projectile.

#+BEGIN_SRC emacs-lisp
  ;; Ignore files/directories
  (add-to-list 'projectile-globally-ignored-files "*.out")
  (add-to-list 'projectile-globally-ignored-files ".DS_Store")
  (add-to-list 'projectile-globally-ignored-directories ".git")
  ;; retore projectile's native indexing (fix the bug of disabling .projectile)
  (setq projectile-indexing-method 'native)
#+END_SRC

*** Summary of keybindings

|-------------+---------------------------------------------+--------------------------------------------------------------|
| Keybindings | Commands                                    | Descriptions                                                 |
|-------------+---------------------------------------------+--------------------------------------------------------------|
| =C-c p h=   | helm-projectile                             | Helm interface to projectile                                 |
| =C-c p p=   | helm-projectile-switch-project              | Switches to another projectile project                       |
| =C-c p f=   | helm-projectile-find-file                   | Lists all files in a project                                 |
| =C-c p F=   | helm-projectile-find-file-in-known-projects | Find file in all known projects                              |
| =C-c p g=   | helm-projectile-find-file-dwim              | Find file based on context at point                          |
| =C-c p d=   | helm-projectile-find-dir                    | Lists available directories in current project               |
| =C-c p e=   | helm-projectile-recentf                     | Lists recently opened files in current project               |
| =C-c p a=   | helm-projectile-find-other-file             | Switch between files with same name but different extensions |
| =C-c p i=   | projectile-invalidate-cache                 | Invalidate cache                                             |
| =C-c p z=   | projectile-cache-current-file               | Add the file of current selected buffer to cache             |
| =C-c p b=   | helm-projectile-switch-to-buffer            | List all open buffers in current project                     |
| =C-c p s g= | helm-projectile-grep                        | Searches for symbol starting from project root               |
| =C-c p s a= | helm-projectile-ack                         | Same as above but using ack                                  |
| =C-c p s s= | helm-projectile-ag                          | Same as above but using ag                                   |
|-------------+---------------------------------------------+--------------------------------------------------------------|


*** Suppress warnings from project-local variables

#+BEGIN_SRC emacs-lisp
  ;; Safe Variable Declaration (suppress warnings)
  ;; (add-to-list 'safe-local-variable-values
  ;;              '(project-local-include-path . ("-I./include" "-I./src")))
#+END_SRC


* Source code navigation via GNU Global with helm interface

** Requirements
