_emacs.d/init/readme/init-helm.html
<div id="outline-container-orgf7fd082" class="outline-5">
<h5 id="orgf7fd082"><span class="section-number-5">3.3.8.1</span> Command: <code>helm-projectile-grep</code>, <code>C-c p s g</code></h5>
<div class="outline-text-5" id="text-3-3-8-1">
<p>
This is a replacement command for <code>projectile-grep</code> that uses Helm
interface. When a symbol is at point, this command uses that symbol and search
at project root for every occurrence of this symbol in all non-ignored files in
project. If a region is active, use the region instead.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(eval-after-load 'grep
  '(when (boundp 'grep-find-ignored-files)
     (add-to-list 'grep-find-ignored-files <span style="color: #2aa198;">"run"</span>)
     (add-to-list 'grep-find-ignored-directories <span style="color: #2aa198;">"obj"</span>)))
</pre>
</div>

<p>
<span class="underline">Configuration</span>:
</p>

<p>
You can specify directory to exclude when searching by customize either one of
these variables:
</p>

<ul class="org-ul">
<li><code>grep-find-ignored-files</code>: list of file names which rgrep and lgrep shall
exclude. <code>helm-projectile-grep</code> also uses this variable.</li>

<li><code>grep-find-ignored-directories</code>: list of names of sub-directories which
rgrep shall not recurse into. <code>helm-projectile-grep</code> also uses this variable.</li>

<li><code>projectile-globally-ignored-files</code>: list of files globally ignored by
Projectile.</li>

<li><code>projectile-globally-ignored-directories</code>: list of directories globally
ignored by Projectile.</li>
</ul>
</div>
</div>

<div id="outline-container-org87e96ec" class="outline-5">
<h5 id="org87e96ec"><span class="section-number-5">3.3.8.2</span> Command: <code>helm-projectile-ack</code>, <code>C-c p s a</code></h5>
<div class="outline-text-5" id="text-3-3-8-2">
<p>
<span class="underline">Configuration</span>:
</p>

<ul class="org-ul">
<li><code>grep-find-ignored-files</code>: list of file names which rgrep and lgrep shall
exclude, and <code>helm-projectile-ack</code> also uses this variable.</li>

<li><code>grep-find-ignored-directories</code>: list of names of sub-directories which
rgrep shall not recurse into. <code>helm-projectile-ack</code> also uses this variable.</li>

<li><code>projectile-globally-ignored-files</code>: a list of files globally ignored by
Projectile.</li>

<li><code>projectile-globally-ignored-directories</code>: a list of directories globally
ignored by Projectile.</li>
</ul>
</div>
</div>

<div id="outline-container-org937601c" class="outline-5">
<h5 id="org937601c"><span class="section-number-5">3.3.8.3</span> Command: <code>helm-projectile-ag</code>, <code>C-c p s s</code></h5>
<div class="outline-text-5" id="text-3-3-8-3">
<p>
<span class="underline">Configuration</span>:
</p>

<ul class="org-ul">
<li><code>grep-find-ignored-files</code>: list of file names which rgrep and lgrep shall
exclude, and <code>helm-projectile-ack</code> also uses this variable.</li>

<li><code>grep-find-ignored-directories</code>: list of names of sub-directories which
rgrep shall not recurse into. <code>helm-projectile-ack</code> also uses this variable.</li>

<li><code>projectile-globally-ignored-files</code>: a list of files globally ignored by
Projectile.</li>

<li><code>projectile-globally-ignored-directories</code>: a list of directories globally
ignored by Projectile.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Ignore files/directories</span>
(add-to-list 'projectile-globally-ignored-files <span style="color: #2aa198;">"*.out"</span>)
(add-to-list 'projectile-globally-ignored-files <span style="color: #2aa198;">".DS_Store"</span>)
(add-to-list 'projectile-globally-ignored-directories <span style="color: #2aa198;">".git"</span>)
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">retore projectile's native indexing (fix the bug of disabling .projectile)</span>
(<span style="color: #859900;">setq</span> projectile-indexing-method 'native)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd4a97e3" class="outline-4">
<h4 id="orgd4a97e3"><span class="section-number-4">3.3.9</span> Summary of keybindings</h4>
<div class="outline-text-4" id="text-3-3-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybindings</th>
<th scope="col" class="org-left">Commands</th>
<th scope="col" class="org-left">Descriptions</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c p h</code></td>
<td class="org-left">helm-projectile</td>
<td class="org-left">Helm interface to projectile</td>
</tr>

<tr>
<td class="org-left"><code>C-c p p</code></td>
<td class="org-left">helm-projectile-switch-project</td>
<td class="org-left">Switches to another projectile project</td>
</tr>

<tr>
<td class="org-left"><code>C-c p f</code></td>
<td class="org-left">helm-projectile-find-file</td>
<td class="org-left">Lists all files in a project</td>
</tr>

<tr>
<td class="org-left"><code>C-c p F</code></td>
<td class="org-left">helm-projectile-find-file-in-known-projects</td>
<td class="org-left">Find file in all known projects</td>
</tr>

<tr>
<td class="org-left"><code>C-c p g</code></td>
<td class="org-left">helm-projectile-find-file-dwim</td>
<td class="org-left">Find file based on context at point</td>
</tr>

<tr>
<td class="org-left"><code>C-c p d</code></td>
<td class="org-left">helm-projectile-find-dir</td>
<td class="org-left">Lists available directories in current project</td>
</tr>

<tr>
<td class="org-left"><code>C-c p e</code></td>
<td class="org-left">helm-projectile-recentf</td>
<td class="org-left">Lists recently opened files in current project</td>
</tr>

<tr>
<td class="org-left"><code>C-c p a</code></td>
<td class="org-left">helm-projectile-find-other-file</td>
<td class="org-left">Switch between files with same name but different extensions</td>
</tr>

<tr>
<td class="org-left"><code>C-c p i</code></td>
<td class="org-left">projectile-invalidate-cache</td>
<td class="org-left">Invalidate cache</td>
</tr>

<tr>
<td class="org-left"><code>C-c p z</code></td>
<td class="org-left">projectile-cache-current-file</td>
<td class="org-left">Add the file of current selected buffer to cache</td>
</tr>

<tr>
<td class="org-left"><code>C-c p b</code></td>
<td class="org-left">helm-projectile-switch-to-buffer</td>
<td class="org-left">List all open buffers in current project</td>
</tr>

<tr>
<td class="org-left"><code>C-c p s g</code></td>
<td class="org-left">helm-projectile-grep</td>
<td class="org-left">Searches for symbol starting from project root</td>
</tr>

<tr>
<td class="org-left"><code>C-c p s a</code></td>
<td class="org-left">helm-projectile-ack</td>
<td class="org-left">Same as above but using ack</td>
</tr>

<tr>
<td class="org-left"><code>C-c p s s</code></td>
<td class="org-left">helm-projectile-ag</td>
<td class="org-left">Same as above but using ag</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org48f9544" class="outline-4">
<h4 id="org48f9544"><span class="section-number-4">3.3.10</span> Suppress warnings from project-local variables</h4>
<div class="outline-text-4" id="text-3-3-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Safe Variable Declaration (suppress warnings)</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(add-to-list 'safe-local-variable-values</span>
<span style="color: #93a1a1; font-style: italic;">;;              </span><span style="color: #93a1a1; font-style: italic;">'(project-local-include-path . ("-I./include" "-I./src")))</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org4b615f9" class="outline-2">
<h2 id="org4b615f9"><span class="section-number-2">4</span> Source code navigation via GNU Global with helm interface</h2>
<div class="outline-text-2" id="text-4">
</div>
