_emacs.d/init/init-helm.el

(eval-after-load 'grep
  '(when (boundp 'grep-find-ignored-files)
     (add-to-list 'grep-find-ignored-files "run")
     (add-to-list 'grep-find-ignored-directories "obj")))

;; Ignore files/directories
(add-to-list 'projectile-globally-ignored-files "*.out")
(add-to-list 'projectile-globally-ignored-files ".DS_Store")
(add-to-list 'projectile-globally-ignored-directories ".git")
;; retore projectile's native indexing (fix the bug of disabling .projectile)
(setq projectile-indexing-method 'native)

;; Safe Variable Declaration (suppress warnings)
;; (add-to-list 'safe-local-variable-values
;;              '(project-local-include-path . ("-I./include" "-I./src")))

;; ================================================================
