_emacs.d/init/readme/init-helm.html
<div id="outline-container-orgd581616" class="outline-3">
<h3 id="orgd581616"><span class="section-number-3">4.1</span> Requirements</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgd7e4724" class="outline-4">
<h4 id="orgd7e4724"><span class="section-number-4">4.1.1</span> Emacs packages</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">================================================================</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Tag Supports in Programming Environement</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">================================================================</span>

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Install required packages for more functions</span>
(<span style="color: #859900;">setq</span> custom/gtags-packages
      '(helm-gtags))
(custom/install-packages custom/gtags-packages)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2bf653c" class="outline-4">
<h4 id="org2bf653c"><span class="section-number-4">4.1.2</span> System commandline tools</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
The tagging system we used is <code>GNU global</code> with <code>ctags &amp; pygments</code> supports. To
install <code>global</code>:
</p>
<ul class="org-ul">
<li>OS X: <code>brew install global --with-ctags --with-pygments</code></li>
<li>Arch Linux: <code>pacman -S ctags python-pygments</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setenv <span style="color: #2aa198;">"GTAGSLABEL"</span> <span style="color: #2aa198;">"pygments"</span>)
(setenv <span style="color: #2aa198;">"GTAGSLIBPATH"</span> (concat (getenv <span style="color: #2aa198;">"HOME"</span>) <span style="color: #2aa198;">"/.gtags/"</span>)) <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">if tag system libs</span>
</pre>
</div>

<p>
To create tags, choose either way as follows:
</p>
<ul class="org-ul">
<li>console: <code>gtags --gtagslabel=pygments</code> (no option if set env var)</li>
<li>helm-gtags: <code>helm-gtags-create-tags</code> (<code>C-c g c</code>)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org56e8efa" class="outline-3">
<h3 id="org56e8efa"><span class="section-number-3">4.2</span> Frontend via helm-gtags</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org84ae0d0" class="outline-4">
<h4 id="org84ae0d0"><span class="section-number-4">4.2.1</span> Basic settings</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">helm-gtags</span>)
(<span style="color: #859900;">setq</span> helm-gtags-ignore-case             t
      helm-gtags-auto-update             t
      helm-gtags-use-input-at-cursor     t
      helm-gtags-pulse-at-cursor         t
      helm-gtags-prefix-key              <span style="color: #2aa198;">"\C-cg"</span>
      helm-gtags-suggested-key-mapping   t)

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Enable helm-gtags mode</span>
(add-hook 'dired-mode-hook 'helm-gtags-mode)
(add-hook 'eshell-mode-hook 'helm-gtags-mode)
(add-hook 'makefile-mode-hook 'helm-gtags-mode)
(add-hook 'c-mode-hook 'helm-gtags-mode)
(add-hook 'c++-mode-hook 'helm-gtags-mode)
(add-hook 'python-mode-hook 'helm-gtags-mode)
(add-hook 'matlab-mode-hook 'helm-gtags-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org384edd7" class="outline-4">
<h4 id="org384edd7"><span class="section-number-4">4.2.2</span> Keybindings</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Jumps through definitions, references, symbols or DWIM:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"M-."</span>) 'helm-gtags-dwim)
(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"M-,"</span>) 'helm-gtags-pop-stack)
(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"M-t"</span>) 'helm-gtags-find-tag)    <span style="color: #93a1a1; font-style: italic;">;</span><span style="color: #93a1a1; font-style: italic;">(definitions)</span>
(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"M-r"</span>) 'helm-gtags-find-rtag)   <span style="color: #93a1a1; font-style: italic;">;</span><span style="color: #93a1a1; font-style: italic;">(references)</span>
(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"M-s"</span>) 'helm-gtags-find-symbol) <span style="color: #93a1a1; font-style: italic;">;</span><span style="color: #93a1a1; font-style: italic;">(symbols)</span>
</pre>
</div>

<p>
Show list of tags in different scopes: project, file, function:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"C-c g s"</span>) 'helm-gtags-select)
(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"C-c g f"</span>) 'helm-gtags-parse-file)
(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"C-c g a"</span>) 'helm-gtags-tags-in-this-function)
</pre>
</div>

<p>
Jumping over history/stacks:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"C-c g ["</span>) 'helm-gtags-previous-history)
(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"C-c g ]"</span>) 'helm-gtags-next-history)
(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"C-c g h"</span>) 'helm-gtags-show-stack)
</pre>
</div>

<p>
Create/update tags:
(Note: prefix "C-u" update the whole project, instead of the current file)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"C-c g c"</span>) 'helm-gtags-create-tags)
(define-key helm-gtags-mode-map (kbd <span style="color: #2aa198;">"C-c g u"</span>) 'helm-gtags-update-tags)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5c6b694" class="outline-3">
<h3 id="org5c6b694"><span class="section-number-3">4.3</span> More on source code navigation by tuhdo.github.io</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<a href="http://tuhdo.github.io/c-ide.html">http://tuhdo.github.io/c-ide.html</a>
</p>

<p>
Basic concepts of tag files:
</p>
<ul class="org-ul">
<li><code>GTAGS</code>:  definition database</li>
<li><code>GRTAGS</code>: reference database</li>
<li><code>GPATH</code>:  path name database</li>
</ul>

<p>
Find definitions in project:
</p>
<ul class="org-ul">
<li><code>helm-gtags-dwim</code>: jump to a reference/tag definition/header</li>
<li><code>tags-loop-continue</code>: jump back to original location</li>
<li><code>helm-gtags-select</code>: use helm to display all available tags in a project and
incrementally filtering</li>
</ul>

<p>
Find references in project:
</p>
<ul class="org-ul">
<li><code>helm-gtags-dwim</code> or <code>helm-gtags-find-rtags</code>: find references to functions only</li>
<li><code>helm-gtags-find-symbol</code>: find references to variables</li>
</ul>

<p>
Find functions that current functions call:
</p>
<ul class="org-ul">
<li><code>helm-gtags-tags-in-this-function</code>: list all the functions that the current
function that point is inside calls</li>
</ul>

<p>
Find files in project:
</p>
<ul class="org-ul">
<li><code>helm-gtags-find-files</code>: find files matching regexp. (If point is on an
included header file, <code>helm-gtags-dwim</code> automatically jumps to files)</li>
</ul>

<p>
View visited tags with tag stack:
</p>
<ul class="org-ul">
<li><code>helm-gtags-show-stack</code>: show visited tags from newest to oldest, from top to
bottom.</li>
</ul>

<p>
Show outline tree of definitions in current buffer via <code>function-args</code>
</p>
<ul class="org-ul">
<li><code>moo-jump-local</code> (<code>C-M-j</code>): shows an outline tree of the current buffer</li>
<li><code>moo-jump-directory</code> (<code>C-M-k</code>): show outline of the whole folder</li>
</ul>
</div>
</div>
</div>
